package com.thzhima.base.work;

public class 练习2 {

	public static void main(String[] args) {
		/*******************************************************************
		 * 《九章算术》鸡公一值钱五，鸡母一值钱三，鸡雏三值钱一。
		 *   今有百钱，欲买百鸡，各几何？
		 *******************************************************************/
		for(int w =1; w<20; w++) { // w 为鸡公数量
			
			for( int m=1; m<33; m++) {  // m为鸡母数量
				
				for(int c=3; c<99; c+=3) {
					
					int count = w + m + c;
					int amount = w * 5 + m *3 + c / 3;
					if(100 == count && 100 == amount) {
						System.out.println("鸡公："+ w + ", 鸡母：" + m + ", 鸡雏：" + c);
						break;
					}
				}
			}
			
		}
		
		
		/*****************************************************************
		 * 100多个人排队，3人一组多1人，4人一组多两人，5人一组多3人。问有多少人？ 
		 *****************************************************************/
		for(int i =100; i<200; i++) {
			if( 1 == i%3 
			    && 2 == i%4 
			    && 3 == i%5 ) {
				System.out.println("人数是：" + i);
			}
		}
		
		
		/*******************************************************************
		 * 今有物不知其数，三三数之剩二，五五数之剩三，七七数之剩二，问物几何？
		 *****************************************************************/
		
		/*******************************************************************
		 * 有15个空瓶子，每4个空瓶子可以换一瓶水。问一共可以换多少瓶水？ 
		 ********************************************************************/
		int count = 0;
		for(int p = 15; p>=4 ; ) {
			p-=4; p+=1;count++;
		}
		System.out.println("可以换" + count + "瓶");
	}
}
